In [41]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from pandas import Series

## 1. Criando um dict e armazenando em formato Dataframe

In [17]:
#dataframe cria um objeto
df = DataFrame({'key1' : ['a', 'a', 'a', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5),'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.870939 -1.746098    a  one
1 -1.374953 -1.301488    a  two
2  0.223346 -0.825697    a  one
3  0.061128 -0.318443    b  two
4  1.514076 -1.239957    a  one

In [18]:
# utiliza os indices de key1 (dict) para agrupar
grouped = df['data1'].groupby(df['key1'])
grouped

In [19]:
# como b só tinha um indice a média de b ficara igual ao valor de data 1 na linha 4 
grouped.mean()

key1
a    0.308352
b    0.061128
Name: data1, dtype: float64

In [21]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.869453
      two    -1.374953
b     two     0.061128
Name: data1, dtype: float64

In [25]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     3
      two     1
b     two     1
dtype: int64

In [27]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print ('k1:',k1)
    print ('group:',group)

k1: a
group:       data1     data2 key1 key2
0  0.870939 -1.746098    a  one
2  0.223346 -0.825697    a  one
4  1.514076 -1.239957    a  one
k1: a
group:       data1     data2 key1 key2
1 -1.374953 -1.301488    a  two
k1: b
group:       data1     data2 key1 key2
3  0.061128 -0.318443    b  two

## 2. Groupping with dict and Series

In [28]:
people = DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [32]:
people

               a         b         c         d         e
Joe     0.749524  0.145451 -1.782171 -2.933403  0.088081
Steve   0.009340 -1.152481 -0.656507 -1.592157  0.213817
Wes     2.129289  1.322169 -0.010017 -0.594971 -0.246485
Jim    -1.090240 -0.701413  0.695680 -1.307144  0.767804
Travis  0.153145 -0.449494 -0.140400 -0.966168 -0.276440

In [31]:
people.dtypes

a    float64
b    float64
c    float64
d    float64
e    float64
dtype: object

In [44]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
type(mapping)

dict

In [35]:
by_column = people.groupby(mapping, axis=1)

<pandas.core.groupby.DataFrameGroupBy object at 0x0000014B26D58080>

In [36]:
by_column.sum()

            blue       red
Joe    -4.715573  0.983056
Steve  -2.248664 -0.929325
Wes    -0.604988  3.204973
Jim    -0.611463 -1.023848
Travis -1.106568 -0.572789

In [43]:
map_series = Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [45]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3